content-org/tools/emacs.org
#+LAYOUT: docs-manual
#+TITLE: EMACS
#+SUMMARY: Magic that your boss will never let you use with a client.
#+TOC: true
#+AUTHOR: Ryan Fleck
#+SEQ_TODO: TODO(t) RECURRING-TODO(r) IN-PROGRESS(p) | DONE(d) CANCELLED(c)
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+DRAFT: true
#+hugo_base_dir: ../../
#+hugo_section: tools
#+hugo_custom_front_matter: :toc true :summary "Magic that your boss will never let you use with a client." :chapter true
#+hugo_custom_front_matter: :aliases '("/el" "/elisp" "/ielm")
#+hugo_custom_front_matter: :warning "THIS FILE WAS GENERATED BY OX-HUGO, DO NOT EDIT!!!"
#+hugo_level_offset: 0

* The Glorious Magic of EMACS


| Package | Shortcut    | Action Description |
|---------+-------------+--------------------|
| Org     | C-c C-x C-a | Archive branch     |
| Emacs   | M-x 5 2     | Break out window   |

* Using Emacs Remotely

It is trivial to use Emacs without a GUI - nearly all the features you
love will still be present when using the system over SSH.

The ~display-graphic-p~ function returns non-nil if the display is
graphical, and ~nil~ if you are in a terminal,

#+begin_src elisp
(when (display-graphic-p)
  (enable-fancy-gui))
#+end_src

** MacOS: Set up iTerm2

The stock terminal doesn't handle the meta key (and others) correctly,
so install open up an iTerm2 window and change the following:

1. Profiles => Default => Keys
   + Check "Report Modifiers using CSI u"
   + Change "Left Option Key" and "Right Option Key" to "~Esc+~"
2. Advanced => SDA (or search 'emacs')
   + Change to '~216~' (this refers to a specific xterm patch)
