content/tools/emacs.md
+++
title = "EMACS"
author = ["Ryan Fleck"]
draft = false
toc = true
summary = "Magic that your boss will never let you use with a client."
chapter = true
aliases = ["/el", "/elisp", "/ielm"]
warning = "THIS FILE WAS GENERATED BY OX-HUGO, DO NOT EDIT!!!"
+++

# The Glorious Magic of EMACS {#the-glorious-magic-of-emacs}

| Package | Shortcut    | Action Description |
|---------|-------------|--------------------|
| Org     | C-c C-x C-a | Archive branch     |
| Emacs   | M-x 5 2     | Break out window   |


# Using Emacs Remotely {#using-emacs-remotely}

It is trivial to use Emacs without a GUI - nearly all the features you
love will still be present when using the system over SSH.

The `display-graphic-p` function returns non-nil if the display is
graphical, and `nil` if you are in a terminal,

```elisp
(when (display-graphic-p)
  (enable-fancy-gui))
```


## MacOS: Set up iTerm2 {#macos-set-up-iterm2}

The stock terminal doesn't handle the meta key (and others) correctly,
so install open up an iTerm2 window and change the following:

1.  Profiles =&gt; Default =&gt; Keys
    -   Check "Report Modifiers using CSI u"
    -   Change "Left Option Key" and "Right Option Key" to "`Esc+`"
2.  Advanced =&gt; SDA (or search 'emacs')
    -   Change to '`216`' (this refers to a specific xterm patch)
